/******************************************************************************

  版权所有 (C), 2017-2028, _ _ _ Co., Ltd.

 ******************************************************************************
  文件名称: bll_wheel_drop.cpp
  版本编号: 初稿
  作     者: Leon
  生成日期: 2017年12月21日
  最近修改:
  功能描述   : 跌落传感器类定义
  函数列表:
  修改历史:
  1.日     期: 2017年12月21日
    作     者: Leon
    修改内容: 创建文件
******************************************************************************/

/******************************************************************************
 * 包含头文件
 ******************************************************************************/
#include "bll_wheel_drop.h"

#include "bll_motion_control.h"

#include "cfg_if_mobile_robot.h"
#include "debug_function.h"

/******************************************************************************
 * 外部变量定义
 ******************************************************************************/

/******************************************************************************
 * 外部函数定义
 ******************************************************************************/

/******************************************************************************
 * 全局变量
 ******************************************************************************/

/******************************************************************************
 * 宏定义
 ******************************************************************************/

/******************************************************************************
 * 常量声明
 ******************************************************************************/

/******************************************************************************
 * 枚举类型
 ******************************************************************************/

/******************************************************************************
 * 结构体类型
 ******************************************************************************/

/******************************************************************************
 * 类定义
 ******************************************************************************/
pthread_mutex_t bll_wheel_drop::mutex_;
bll_wheel_drop* bll_wheel_drop::p_instance_ = nullptr;

/*****************************************************************************
 函 数 名: bll_wheel_drop.bll_wheel_drop
 功能描述  : 构造函数
 输入参数  : 无
 输出参数: 无
 返 回 值: bll_wheel_drop
 
 修改历史:
  1.日     期: 2017年12月21日
    作     者: Leon
    修改内容: 新生成函数
*****************************************************************************/
bll_wheel_drop::bll_wheel_drop()
{

}

/*****************************************************************************
 函 数 名: bll_wheel_drop.~bll_wheel_drop
 功能描述  : 析构函数
 输入参数  : 无
 输出参数: 无
 返 回 值: bll_wheel_drop
 
 修改历史:
  1.日     期: 2017年12月21日
    作     者: Leon
    修改内容: 新生成函数
*****************************************************************************/
bll_wheel_drop::~bll_wheel_drop()
{

}

/*****************************************************************************
 函 数 名: bll_wheel_drop.get_instance
 功能描述  : 获取实例
 输入参数: void  
 输出参数: 无
 返 回 值: bll_wheel_drop*
 
 修改历史:
  1.日     期: 2017年12月21日
    作     者: Leon
    修改内容: 新生成函数
*****************************************************************************/
bll_wheel_drop* bll_wheel_drop::get_instance(void)
{
	if (nullptr == p_instance_)
	{
		pthread_mutex_lock(&mutex_);
		if (nullptr == p_instance_)
		{
			p_instance_ = new bll_wheel_drop();
		}
		pthread_mutex_unlock(&mutex_);
	}
	return p_instance_;
}

/*****************************************************************************
 函 数 名: bll_wheel_drop.release_instance
 功能描述  : 释放实例
 输入参数: void  
 输出参数: 无
 返 回 值: void
 
 修改历史:
  1.日     期: 2017年12月21日
    作     者: Leon
    修改内容: 新生成函数
*****************************************************************************/
void bll_wheel_drop::release_instance(void)
{
	if (nullptr != p_instance_)
	{
		pthread_mutex_lock(&mutex_);
		if (nullptr != p_instance_)
		{
			delete p_instance_;
			p_instance_ = nullptr;
		}
		pthread_mutex_unlock(&mutex_);
	}
}

/*****************************************************************************
 函 数 名: bll_wheel_drop.update_wheel_drop_state
 功能描述  : 更新跌落传感器状态
 输入参数: uint8_t id     
           uint8_t value  
 输出参数: 无
 返 回 值: void
 
 修改历史:
  1.日     期: 2017年12月21日
    作     者: Leon
    修改内容: 新生成函数
*****************************************************************************/
void bll_wheel_drop::update_wheel_drop_state(uint8_t id, uint8_t value)
{
	bool ret = false;
	bool wheel_state = false;
	WHEEL_ID_ENUM wheel_id;
	
	ret = cfg_if_convert_wheel_drop_id(id, wheel_id);
	if ( false == ret )
	{
		debug_print_warnning("id = %d", id);
		return;
	}
	
	ret = cfg_if_convert_wheel_drop_state(value, wheel_state);
	if ( false == ret )
	{
		debug_print_warnning("value = %d", value);
		return;
	}
	
	if (true == wheel_state)
	{
		debug_print_error("id=%d, wheel_id=%d; value=%d, wheel_state=%d", id, wheel_id, value, wheel_state);
	}
	cfg_if_set_wheel_drop_state(wheel_id, wheel_state);
}

/*****************************************************************************
 函 数 名: bll_wheel_drop.wheel_drop_sensor_respond_deal
 功能描述  : 跌落传感器处理
 输入参数: void  
 输出参数: 无
 返 回 值: void
 
 修改历史:
  1.日     期: 2017年12月21日
    作     者: Leon
    修改内容: 新生成函数
*****************************************************************************/
void bll_wheel_drop::wheel_drop_sensor_respond_deal(void)
{
	bool curr_is_normal = true;
	static bool last_is_normal = true;

	curr_is_normal = cfg_if_test_wheel_sensor_is_normal();
	if ( false == curr_is_normal )
	{
		if ( true == last_is_normal )
		{
			cfg_if_save_running_status();
			bll_motion_control* p_instance = bll_motion_control::get_instance();
			p_instance->stop();
		}
	}
	else
	{
		if ( false == last_is_normal )
		{
			cfg_if_recover_running_status();
		}
	}
}

/******************************************************************************
 * 内部函数定义
 ******************************************************************************/


