/******************************************************************************

  版权所有 (C), 2017-2028 惠州市蓝微电子有限公司

 ******************************************************************************
  文件名称: bll_motion_control.h
  版本编号: 初稿
  作     者: Leon
  生成日期: 2017年12月19日
  最近修改:
  功能描述: bll_motion_control.cpp 的头文件
  函数列表:
  修改历史:
  1.日     期: 2017年12月19日
    作     者: Leon
    修改内容: 创建文件
******************************************************************************/
#ifndef __BLL_MOTION_CONTROL_H__
#define __BLL_MOTION_CONTROL_H__

/*****************************************************************************/
#ifdef __cplusplus
#if __cplusplus
//extern "C"{
#endif
#endif /* __cplusplus */
/*****************************************************************************/

/******************************************************************************
 * 包含头文件
 ******************************************************************************/
#include "base_type.h"

#include <pthread.h>

/******************************************************************************
 * 外部变量声明
 ******************************************************************************/

/******************************************************************************
 * 外部函数声明
 ******************************************************************************/

/******************************************************************************
 * 全局变量
 ******************************************************************************/

/******************************************************************************
 * 宏定义
 ******************************************************************************/

/******************************************************************************
 * 常量声明
 ******************************************************************************/

/******************************************************************************
 * 枚举类型
 ******************************************************************************/

/******************************************************************************
 * 结构体类型
 ******************************************************************************/

/******************************************************************************
 * 类声明
 ******************************************************************************/

class bll_motion_control
{
protected:
	bll_motion_control();
	~bll_motion_control();
	
public:
	static bll_motion_control* get_instance(void);
	static void release_instance();

	void set_motion_control_velocity(double line_v, double angular_v);
	void straight_moving(double line_v);
	void rotate_moving(double angular_v);
	
	void stop(void);
	void go_forward(void);
	void go_back(void);
	void turn_left(void);
	void turn_right(void);
	void pivot(void);

	void turn_back_clockwise(void);
	void turn_back_anticlockwise(void);

	void turn_right_angle_clockwise(void);
	void turn_right_angle_anticlockwise(void);

private:
	bll_motion_control(const bll_motion_control&){};
	bll_motion_control& operator=(const bll_motion_control&){};
	
	static bll_motion_control* p_instance_;
	static pthread_mutex_t mutex_;

	static constexpr double Linear_velocity_ = 0.25;               //线速度(m/s)
	static constexpr double Angular_velocity_ = 0.8;               //角速度(rad/s)
	static constexpr double Linear_velocity_clockwise_ = 0.08;//0.15;     //顺时针旋转返回线速度(m/s)
	static constexpr double Angular_velocity_clockwise_ = 1.0;//0.8;     //顺时针旋转返回角速度(rad/s)
};



/******************************************************************************
 * 内部函数声明
 ******************************************************************************/

/*****************************************************************************/
#ifdef __cplusplus
#if __cplusplus
//}
#endif
#endif /* __cplusplus */
/*****************************************************************************/

#endif /* __BLL_MOTION_CONTROL_H__ */
