/******************************************************************************

  Copyright (C), 2017-2028, _ _ _ Co., Ltd.

 ******************************************************************************
  File Name     : key_base.h
  Version       : Initial Draft
  Author        : Leon
  Created       : 2018/2/11
  Last Modified :
  Description   : key basic data structure header file
  Function List :
  History       :
  1.Date        : 2018年2月11日
    Author      : Leon
    Modification: Created file
******************************************************************************/
#ifndef __KEY_BASE_H__
#define __KEY_BASE_H__

/*****************************************************************************/
#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */
/*****************************************************************************/

/******************************************************************************
 * include header files list
 ******************************************************************************/
#include <stdint.h>

/******************************************************************************
 * external variables
 ******************************************************************************/

/******************************************************************************
 * external function prototypes
 ******************************************************************************/

/******************************************************************************
 * project-wide global variables
 ******************************************************************************/

/******************************************************************************
 * macros
 ******************************************************************************/

/******************************************************************************
 * constants
 ******************************************************************************/

/******************************************************************************
 * enum
 ******************************************************************************/
typedef enum KEY_STATUS
{
	KEY_RELEASED,
	KEY_PRESSED,
	KEY_STATUS_INVALID,
	KEY_STATUS_SUM,
}KEY_STATUS_ENUM;

/******************************************************************************
 * struct
 ******************************************************************************/
typedef struct KEY_TIMER
{
	bool enable;
	uint32_t time;
}KEY_TIMER_STRU;

//按键数据类型
typedef struct KEY
{
	KEY_STATUS_ENUM status;            //按键当前状态
	bool record_time;                  //是否已经记录时间点标记
	bool single_click;                 //单击短按标志
	bool double_click;                 //双击短按标志
	bool long_click;                   //单击长按标志
	KEY_TIMER_STRU release_timer;      //释放定时器
	uint8_t click_num;                 //连续短按几次
	uint32_t max_dblclick_takt_time;   //有效连按:两次短按之间的最大有效时间间隔
	uint32_t min_click_time;           //最小的有效按键时间:保持按住的最短时间
	uint32_t min_long_press_time;      //最小的有效长按时间:保持按住的最短时间
	uint64_t press_tick;               //按键按下的时刻
	uint64_t release_tick;             //按键释放的时刻
	uint64_t press_long;               //按键按下的保持的时间长度
	uint64_t release_long;             //按键释放的保持的时间长度
}KEY_STRU;

/******************************************************************************
 * class prototypes
 ******************************************************************************/

/******************************************************************************
 * internal function prototypes
 ******************************************************************************/



/*****************************************************************************/
#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */
/*****************************************************************************/

#endif /* __KEY_BASE_H__ */
