/******************************************************************************

  版权所有 (C), 2017-2028, _ _ _ Co., Ltd.

 ******************************************************************************
  文件名称: bll_cliff.cpp
  版本编号: 初稿
  作     者: Leon
  生成日期: 2017年12月21日
  最近修改:
  功能描述: 
  函数列表:
  修改历史:
  1.日     期: 2017年12月21日
    作     者: Leon
    修改内容: 创建文件
******************************************************************************/

/******************************************************************************
 * 包含头文件
 ******************************************************************************/
#include "bll_cliff.h"

#include "cfg_if_mobile_robot.h"
#include "debug_function.h"

/******************************************************************************
 * 外部变量定义
 ******************************************************************************/

/******************************************************************************
 * 外部函数定义
 ******************************************************************************/

/******************************************************************************
 * 全局变量
 ******************************************************************************/

/******************************************************************************
 * 宏定义
 ******************************************************************************/

/******************************************************************************
 * 常量定义
 ******************************************************************************/

/******************************************************************************
 * 枚举类型
 ******************************************************************************/

/******************************************************************************
 * 结构体类型
 ******************************************************************************/

/******************************************************************************
 * 类声明
 ******************************************************************************/
pthread_mutex_t bll_cliff::mutex_;
bll_cliff* bll_cliff::p_instance_ = nullptr;

/*****************************************************************************
 函 数 名: bll_cliff.bll_cliff
 功能描述  : 构造函数
 输入参数  : 无
 输出参数: 无
 返 回 值: bll_cliff
 
 修改历史:
  1.日     期: 2017年12月21日
    作     者: Leon
    修改内容: 新生成函数
*****************************************************************************/
bll_cliff::bll_cliff()
{

}

/*****************************************************************************
 函 数 名: bll_cliff.~bll_cliff
 功能描述  : 析构函数
 输入参数  : 无
 输出参数: 无
 返 回 值: bll_cliff
 
 修改历史:
  1.日     期: 2017年12月21日
    作     者: Leon
    修改内容: 新生成函数
*****************************************************************************/
bll_cliff::~bll_cliff()
{

}

/*****************************************************************************
 函 数 名: bll_cliff.get_instance
 功能描述  : 获取实例
 输入参数: void  
 输出参数: 无
 返 回 值: bll_cliff*
 
 修改历史:
  1.日     期: 2017年12月21日
    作     者: Leon
    修改内容: 新生成函数
*****************************************************************************/
bll_cliff* bll_cliff::get_instance(void)
{
	if (nullptr == p_instance_)
	{
		pthread_mutex_lock(&mutex_);
		if (nullptr == p_instance_)
		{
			p_instance_ = new bll_cliff();
		}
		pthread_mutex_unlock(&mutex_);
	}
	return p_instance_;
}

/*****************************************************************************
 函 数 名: bll_cliff.release_instance
 功能描述  : 释放实例
 输入参数: void  
 输出参数: 无
 返 回 值: void
 
 修改历史:
  1.日     期: 2017年12月21日
    作     者: Leon
    修改内容: 新生成函数
*****************************************************************************/
void bll_cliff::release_instance(void)
{
	if (nullptr != p_instance_)
	{
		pthread_mutex_lock(&mutex_);
		if (nullptr != p_instance_)
		{
			delete p_instance_;
			p_instance_ = nullptr;
		}
		pthread_mutex_unlock(&mutex_);
	}
}

/*****************************************************************************
 函 数 名: bll_cliff.upate_cliff_state
 功能描述  : 更新悬崖传感器状态
 输入参数: uint8_t id     
           uint8_t value  
 输出参数: 无
 返 回 值: void
 
 修改历史:
  1.日     期: 2017年12月14日
    作     者: Leon
    修改内容: 新生成函数
*****************************************************************************/
void bll_cliff::upate_cliff_state(uint8_t id, uint8_t value)
{
	bool flag = false;
	bool cliff_status = false;
	CLIFF_ID_ENUM cliff_id;
	static bool last_status[4] = {false, false, false, false};

	flag = cfg_if_convert_cliff_id(id, cliff_id);
	if (false == flag)
	{
		debug_print_warnning("id = %d", id);
		return;
	}

	flag = cfg_if_convert_cliff_state(value, cliff_status);
	if (false == flag)
	{
		debug_print_warnning("value = %d", value);
		return;
	}

	cfg_if_set_cliff_state(cliff_id, cliff_status);

	if (last_status[id] != cliff_status)
	{
		last_status[id] = cliff_status;

		if (last_status[id] == false)
		{
			debug_print_info("cliff sensor[%d] status[%d] is normal !", id, cliff_status);
		}
		else
		{
			debug_print_error("cliff sensor[%d] status[%d] is abnormal !", id, cliff_status);
		}
	}
}

/*****************************************************************************
 函 数 名: bll_cliff.cliff_sensor_respond_deal
 功能描述  : 悬崖传感器处理
 输入参数: void  
 输出参数: 无
 返 回 值: void
 
 修改历史:
  1.日     期: 2017年12月21日
    作     者: Leon
    修改内容: 新生成函数
*****************************************************************************/
void bll_cliff::cliff_sensor_respond_deal(void)
{
	bool ret = true;

	ret = cfg_if_test_robot_is_ok();
	if (false == ret )
	{
		return;
	}
}

/******************************************************************************
 * 内部函数定义
 ******************************************************************************/


