/******************************************************************************

  版权所有 (C), 2017-2028, _ _ _ Co., Ltd.

 ******************************************************************************
  文件名称: mobile_robot_type.h
  版本编号: 初稿
  作     者: Leon
  生成日期: 2018年1月2日
  最近修改:
  功能描述: mobile_robot_type.h 的头文件
  函数列表:
  修改历史:
  1.日     期: 2018年1月2日
    作     者: Leon
    修改内容: 创建文件
******************************************************************************/
#ifndef __MOBILE_ROBOT_TYPE_H__
#define __MOBILE_ROBOT_TYPE_H__

/******************************************************************************
 * 包含头文件
 ******************************************************************************/

/******************************************************************************
 * 外部变量声明
 ******************************************************************************/

/******************************************************************************
 * 外部函数声明
 ******************************************************************************/

/******************************************************************************
 * 全局变量
 ******************************************************************************/

/******************************************************************************
 * 宏定义
 ******************************************************************************/

/******************************************************************************
 * 常量声明
 ******************************************************************************/

/******************************************************************************
 * 枚举类型
 ******************************************************************************/
//移动机器人行动状态
typedef enum ACTION_STATUS_ID
{
	STOP = 0,                                  //停止运行
	GO_FORWARD,                                //向前运行
	GO_BACK,                                   //后退运行
	TURN_LEFT,                                 //左转
	TURN_RIGHT,                                //右转
	PIVOT,                                     //原地向后旋转180度
	TURN_BACK_CLOCKWISE,                       //顺时针向后转180度
	TURN_BACK_ANTICLOCKWISE,                   //逆时针向后转180度
	TURN_RIGHT_ANGLE_CLOCKWISE,                //原地顺时针旋转90度
	TURN_RIGHT_ANGLE_ANTICLOCKWISE,            //原地逆时针旋转90度
	EDGE_WAYS,                                 //沿边运行
	AUTO_DOCK,                                 //自动返程
	LOCAL_AREA,                                //区域覆盖运行
}ACTION_STATUS_ENUM;

typedef enum PARTITION_DRIVING_STATE
{
	PARTITION_DRIVING_STOP,//0
	PARTITION_DRIVING_START,
	PARTITION_DRIVING_PIVOT,
	PARTITION_DRIVING_FST_LINE_START,
	PARTITION_DRIVING_FST_HALF,
	PARTITION_DRIVING_FST_HALF_DONE,//5
	PARTITION_DRIVING_RETURN_REFER_LINE,
	PARTITION_DRIVING_SEC_HALF_START,
	PARTITION_DRIVING_SEC_HALF,
	PARTITION_DRIVING_SEC_HALF_DONE,
	PARTITION_DRIVING_TURN_TO_CENTER_DIR,//10
	PARTITION_DRIVING_RETURN_CENTER_POS,
	PARTITION_DRIVING_TURN_TO_ORIGINAL_DIR,
	PARTITION_DRIVING_ALL_DONE,
}PARTITION_DRIVING_STATE_ENUM;

typedef enum PARTITION_DRIVING
{
	AMBIENT_NO_OBSTACLE,
	AMBIENT_HAS_OBSTACLE,
}PARTITION_DRIVING_ENUM;

typedef enum MOVE_DIRECTION
{
	FORWARD,                                 //向前行走
	BACKWARD,                                //向前行走
}MOVE_DIRECTION_ENUM;

typedef enum AREA_PART
{
	AREA_PART_LEFT,                          //左边区域
	AREA_PART_RIGHT,                         //右边区域
}AREA_PART_ENUM;

/******************************************************************************
 * 结构体类型
 ******************************************************************************/

/******************************************************************************
 * 类声明
 ******************************************************************************/

/******************************************************************************
 * 内部函数声明
 ******************************************************************************/



/*****************************************************************************/
#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */
/*****************************************************************************/

/*****************************************************************************/
#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */
/*****************************************************************************/

#endif /* __MOBILE_ROBOT_TYPE_H__ */
